<template>
  <div class="container mx-auto md:pt-10 p-5 md:p-0">
    <h1 class="text-2xl font-bold mb-4">О нас</h1>
    <div class="grid md:grid-cols-2 gap-4">
      <div class="col-span-1">
        <img
          src="../assets/images/map.png"
          alt="about"
          class="w-full h-full max-h-[400px] object-cover"
        />
      </div>
      <div class="col-span-1">
        <h2 class="text-xl font-bold mb-4">BilimAI</h2>
        <template v-if="locale === 'ru'">
          <p class="text-gray-500 mb-4">
            Президент Республики Казахстан К. Токаев в своем Послании от 1
            сентября 2021 года «Единство народа и системные реформы – прочная
            основа процветания страны» особо отметил, что цифровизация является
            одним из приоритетных направлений развития государства. Цифровая
            грамотность позволяет молодому поколению свободно получать
            информацию в любой сфере, развивать свой потенциал, совершенствовать
            навыки и формировать многопрофильные компетенции.
          </p>
          <p class="text-gray-500 mb-4">
            Это важный фактор, который делает молодежь конкурентоспособной и
            помогает эффективно реализовывать свои возможности в образовательном
            пространстве. Кроме того, цифровизация способствует повышению
            качества образования, доступности учебного процесса и упрощению
            коммуникации между учителями, учащимися и родителями.
          </p>
          <p class="text-gray-500 mb-4">
            <span class="font-bold">BilimAI</span>
            – это первая казахстанская современная информационно-познавательная
            платформа, где объединяются образование и инновации, поддерживая
            направления, обозначенные в Послании Президента. Наша цель –
            представить читателям самые актуальные новости и тенденции в сфере
            образования Казахстана и мира, познакомить с новыми идеями и
            технологическими достижениями.
          </p>
          <p class="text-gray-500 mb-4">
            Мы уделяем особое внимание изменениям в системе образования,
            искусственному интеллекту, цифровому обучению, современным методикам
            и исследованиям. Наша задача – не только предоставлять полезную
            информацию, но и создавать контент, который вдохновляет, заставляет
            задуматься и побуждает к обсуждению.
          </p>
          <p class="text-gray-500 mb-4">
            <span class="font-bold">BilimAI</span>
            – это пространство знаний и инноваций, устремлённое в будущее. Наш
            главный приоритет – качественная информация и надёжные источники.
            Через каждую публикацию мы стремимся вносить вклад в развитие
            образовательного процесса, распространение новых подходов в обучении
            и укрепление интеллектуального потенциала общества. Это и есть наша
            главная миссия.
          </p>
        </template>
        <template v-else>
          <p class="text-gray-500 mb-4">
            Қазақстан Республикасының президенті Қ. Тоқаевтың 2021 жылғы 1
            қыркүйектегі «Халық бірлігі және жүйелі реформалар – ел өркендеуінің
            берік негізі» атты жолдауында: «цифрландыру - мемлекет дамуының
            басым бағыттарының бірі» екенін ерекше атап өткен болатын. Өйткені
            сандық сауаттылық болашақ ұрпақтың кез келген салада ақпаратқа еркін
            қол жеткізуіне, өз әлеуетін арттырып, шеберлігін шыңдауға,
            іскерлігін жан-жақты дамытуына мүмкіндік береді.
          </p>
          <p class="text-gray-500 mb-4">
            Бұл – жастарды бәсекеге қабілетті қылып, білім кеңістігінде өз
            мүмкіндіктерін тиімді пайдалануға жол ашатын маңызды фактор.
            Сондай-ақ цифрландыру - білім сапасын арттыру, оқыту үдерісін
            қолжетімді ету және мұғалімдер, оқушылар мен ата-аналар арасындағы
            байланысты жеңілдету тұрғысынан да өзекті.
          </p>
          <p class="text-gray-500 mb-4">
            <span class="font-bold">BilimAI</span>
            – президент жолдауымен айқындалған бағыттарды жүзеге асыруға үлес
            қосатын, білім мен инновация тоғысқан қазақстандық алғашқы заманауи
            ақпараттық-танымдық алаң. Біздің мақсатымыз – елдегі және әлемдегі
            білім саласына қатысты өзекті жаңалықтар мен трендтерді оқырманға
            ұсыну, жаңа идеялар мен технологиялық жетістіктермен таныстыру.
          </p>
          <p class="text-gray-500 mb-4">
            Біз білім беру жүйесіндегі өзгерістерге, жасанды интеллект, цифрлық
            оқыту, жаңа әдістемелер мен зерттеулерге назар аударамыз. Оқырманға
            пайдалы ақпарат беріп қана қоймай, ой салатын, талқылауға түрткі
            болатын контент жасауды көздейміз.
          </p>
          <p class="text-gray-500 mb-4">
            <span class="font-bold">BilimAI</span>
            – болашаққа бағытталған білім мен инновация кеңістігі. Біздің басты
            құндылығымыз – сапалы ақпарат пен сенімді дереккөздер. Ал алға
            қойған миссиямыз - әр мақаламыз арқылы білім беру үдерісін
            жетілдіруді, оқытудың жаңа тәсілдерін насихаттау және қоғамның
            зияткерлік әлеуетін арттыру болып табылады.
          </p>
        </template>
        <a-divider />

        <ul class="mb-4">
          <a
            href="tel:+77082390623"
            target="_blank"
            class="hover:text-[#00B5EE] transition-colors"
          >
            <li class="flex items-center gap-2 mb-2">
              <PhoneOutlined />
              +7 (708) 239-06-23
            </li>
          </a>
          <a
            href="mailto:info@example.com"
            target="_blank"
            class="hover:text-[#00B5EE] transition-colors"
          >
            <li class="flex items-center gap-2 mb-2">
              <EnvironmentOutlined />
              Алматы қаласы, Жамбыл көшесі 111, 2-қабат, 16-офис
            </li>
          </a>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { EnvironmentOutlined, PhoneOutlined } from '@ant-design/icons-vue'
import { useI18n } from 'vue-i18n'

const { locale } = useI18n()
</script>
